
// Задача 1: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16 сори время поджимает , поэтому вариант решения :


double powFunc(double arg, double pow){

    return Math.Pow(arg, pow);
}

double result = powFunc(3,5);

System.Console.WriteLine(result);



